Catalogs/Renault_ЧерновикиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ЧерновикиАвтомобилей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Для рег. сведений Автомобиль</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Для рег. сведений Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольноеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Для рег. сведений Автомобиль</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Comment>Цвет автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Comment>Вариант комплектации автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаГарантии</Name>
					<Comment>Дата начала гарантийного срока</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДвигателя</Name>
					<Comment>Тип двигателя автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДвигателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКПП</Name>
					<Comment>Тип КПП автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКПП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AC</Name>
					<Comment>ДопРеквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГУР</Name>
					<Comment>ДопРеквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СалонныйФильтр</Name>
					<Comment>ДопРеквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СемействоАвтомобиля</Name>
					<Comment>ДопРеквизит</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СемействаАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВПрайсЛист</Name>
					<Comment>Включать автомобиль в прайс-лист</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидВключенияВПрайсЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Comment>Используется для ведения дополнительного учета валютной себестомости и цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_ЧерновикиАвтомобилей/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ФормированиеНаименованияЧерновикаАвтомобиля(ГосНомер,ИмяРеквизитаНаименования=Неопределено) Экспорт
	НовоеНаименование="";
	НовоеНаименованиеПолное="";
	Если НЕ обЗначениеНеЗаполнено(Модель) Тогда
		Если НЕ ПустаяСтрока(НовоеНаименование) Тогда
			НовоеНаименование=НовоеНаименование+" ";
		КонецЕсли; 
		НовоеНаименование=НовоеНаименование+СокрЛП(Модель);
		Если НЕ ПустаяСтрока(НовоеНаименованиеПолное) Тогда
			НовоеНаименованиеПолное=НовоеНаименованиеПолное+" ";
		КонецЕсли;
		Если ПустаяСтрока(СокрЛП(Модель.НаименованиеПолное)) Тогда
			НовоеНаименованиеПолное=НовоеНаименованиеПолное+СокрЛП(Модель.Наименование);
		Иначе
			НовоеНаименованиеПолное=НовоеНаименованиеПолное+СокрЛП(Модель.НаименованиеПолное);
		КонецЕсли; 
	КонецЕсли;
	Если НЕ обЗначениеНеЗаполнено(Цвет) Тогда
		Если НЕ ПустаяСтрока(НовоеНаименование) Тогда
			НовоеНаименование=НовоеНаименование+" ";
		КонецЕсли; 
		НовоеНаименование=НовоеНаименование+СокрЛП(Цвет);
		Если НЕ ПустаяСтрока(НовоеНаименованиеПолное) Тогда
			НовоеНаименованиеПолное=НовоеНаименованиеПолное+" ";
		КонецЕсли; 
		НовоеНаименованиеПолное=НовоеНаименованиеПолное+СокрЛП(Цвет);
	КонецЕсли; 
	Если НЕ обЗначениеНеЗаполнено(ГосНомер) Тогда
		Если НЕ ПустаяСтрока(НовоеНаименование) Тогда
			НовоеНаименование=НовоеНаименование+" ";
		КонецЕсли; 
		НовоеНаименование=НовоеНаименование+"№ "+СокрЛП(ГосНомер);
		Если НЕ ПустаяСтрока(НовоеНаименованиеПолное) Тогда
			НовоеНаименованиеПолное=НовоеНаименованиеПолное+" ";
		КонецЕсли; 
		НовоеНаименованиеПолное=НовоеНаименованиеПолное+"№ "+СокрЛП(ГосНомер);
	КонецЕсли;
	Если НЕ обЗначениеНеЗаполнено(VIN) Тогда
		Если НЕ ПустаяСтрока(НовоеНаименование) Тогда
			НовоеНаименование=НовоеНаименование+" ";
		КонецЕсли; 
		НовоеНаименование=НовоеНаименование+"VIN "+СокрЛП(VIN);
		Если НЕ ПустаяСтрока(НовоеНаименованиеПолное) Тогда
			НовоеНаименованиеПолное=НовоеНаименованиеПолное+" ";
		КонецЕсли; 
		НовоеНаименованиеПолное=НовоеНаименованиеПолное+"VIN "+СокрЛП(VIN);
	КонецЕсли;
	Если ИмяРеквизитаНаименования=Неопределено ИЛИ ИмяРеквизитаНаименования="Наименование" Тогда
		Если НЕ ПустаяСтрока(НовоеНаименование) Тогда
			Наименование=НовоеНаименование;
		КонецЕсли; 
	КонецЕсли; 
	Если ИмяРеквизитаНаименования=Неопределено ИЛИ ИмяРеквизитаНаименования="НаименованиеПолное" Тогда
		Если НЕ ПустаяСтрока(НовоеНаименованиеПолное) Тогда
			НаименованиеПолное=НовоеНаименованиеПолное;
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
